garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1765.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PRG1CON2" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PRG1CON2" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x799">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISET" edc:desc="" edc:mask="0x1f" edc:name="ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="ISET0" edc:desc="" edc:mask="0x1" edc:name="ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET1" edc:desc="" edc:mask="0x1" edc:name="ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET2" edc:desc="" edc:mask="0x1" edc:name="ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET3" edc:desc="" edc:mask="0x1" edc:name="ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET4" edc:desc="" edc:mask="0x1" edc:name="ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG1ISET" edc:desc="" edc:mask="0x1f" edc:name="RG1ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RG1ISET0" edc:desc="" edc:mask="0x1" edc:name="RG1ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1ISET1" edc:desc="" edc:mask="0x1" edc:name="RG1ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1ISET2" edc:desc="" edc:mask="0x1" edc:name="RG1ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1ISET3" edc:desc="" edc:mask="0x1" edc:name="RG1ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1ISET4" edc:desc="" edc:mask="0x1" edc:name="RG1ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x800"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x880"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x900"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x980"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xdf0" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD80"/>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0xD8C"/>
        <edc:SFRDef edc:access="---n----" edc:cname="PWMEN" edc:desc="" edc:impl="0x10" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0----" edc:name="PWMEN" edc:nzwidth="8" edc:por="---0----" edc:_addr="0xD8E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="MPWM5EN" edc:desc="" edc:mask="0x1" edc:name="MPWM5EN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n----" edc:cname="PWMLD" edc:desc="" edc:impl="0x10" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0----" edc:name="PWMLD" edc:nzwidth="8" edc:por="---0----" edc:_addr="0xD8F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="MPWM5LD" edc:desc="" edc:mask="0x1" edc:name="MPWM5LD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n----" edc:cname="PWMOUT" edc:desc="" edc:impl="0x10" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0----" edc:name="PWMOUT" edc:nzwidth="8" edc:por="---0----" edc:_addr="0xD90">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="MPWM5OUT" edc:desc="" edc:mask="0x1" edc:name="MPWM5OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM5PH" edc:desc="" edc:name="PWM5PH" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD91">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5PHL" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM5PHL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD91">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5PHL0" edc:desc="" edc:mask="0x1" edc:name="PWM5PHL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHL1" edc:desc="" edc:mask="0x1" edc:name="PWM5PHL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHL2" edc:desc="" edc:mask="0x1" edc:name="PWM5PHL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHL3" edc:desc="" edc:mask="0x1" edc:name="PWM5PHL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHL4" edc:desc="" edc:mask="0x1" edc:name="PWM5PHL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHL5" edc:desc="" edc:mask="0x1" edc:name="PWM5PHL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHL6" edc:desc="" edc:mask="0x1" edc:name="PWM5PHL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHL7" edc:desc="" edc:mask="0x1" edc:name="PWM5PHL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5PHL" edc:desc="" edc:mask="0xff" edc:name="PWM5PHL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5PHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM5PHH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD92">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5PHH0" edc:desc="" edc:mask="0x1" edc:name="PWM5PHH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHH1" edc:desc="" edc:mask="0x1" edc:name="PWM5PHH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHH2" edc:desc="" edc:mask="0x1" edc:name="PWM5PHH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHH3" edc:desc="" edc:mask="0x1" edc:name="PWM5PHH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHH4" edc:desc="" edc:mask="0x1" edc:name="PWM5PHH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHH5" edc:desc="" edc:mask="0x1" edc:name="PWM5PHH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHH6" edc:desc="" edc:mask="0x1" edc:name="PWM5PHH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PHH7" edc:desc="" edc:mask="0x1" edc:name="PWM5PHH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5PHH" edc:desc="" edc:mask="0xff" edc:name="PWM5PHH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM5DC" edc:desc="" edc:name="PWM5DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD93">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5DCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM5DCL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD93">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM5DCL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM5DCL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCL2" edc:desc="" edc:mask="0x1" edc:name="PWM5DCL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCL3" edc:desc="" edc:mask="0x1" edc:name="PWM5DCL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCL4" edc:desc="" edc:mask="0x1" edc:name="PWM5DCL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCL5" edc:desc="" edc:mask="0x1" edc:name="PWM5DCL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCL6" edc:desc="" edc:mask="0x1" edc:name="PWM5DCL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCL7" edc:desc="" edc:mask="0x1" edc:name="PWM5DCL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5DCL" edc:desc="" edc:mask="0xff" edc:name="PWM5DCL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM5DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD94">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM5DCH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM5DCH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM5DCH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM5DCH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM5DCH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM5DCH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM5DCH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM5DCH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5DCH" edc:desc="" edc:mask="0xff" edc:name="PWM5DCH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM5PR" edc:desc="" edc:name="PWM5PR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD95">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM5PRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD95">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5PRL0" edc:desc="" edc:mask="0x1" edc:name="PWM5PRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRL1" edc:desc="" edc:mask="0x1" edc:name="PWM5PRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRL2" edc:desc="" edc:mask="0x1" edc:name="PWM5PRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRL3" edc:desc="" edc:mask="0x1" edc:name="PWM5PRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRL4" edc:desc="" edc:mask="0x1" edc:name="PWM5PRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRL5" edc:desc="" edc:mask="0x1" edc:name="PWM5PRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRL6" edc:desc="" edc:mask="0x1" edc:name="PWM5PRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRL7" edc:desc="" edc:mask="0x1" edc:name="PWM5PRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5PRL" edc:desc="" edc:mask="0xff" edc:name="PWM5PRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM5PRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD96">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5PRH0" edc:desc="" edc:mask="0x1" edc:name="PWM5PRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRH1" edc:desc="" edc:mask="0x1" edc:name="PWM5PRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRH2" edc:desc="" edc:mask="0x1" edc:name="PWM5PRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRH3" edc:desc="" edc:mask="0x1" edc:name="PWM5PRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRH4" edc:desc="" edc:mask="0x1" edc:name="PWM5PRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRH5" edc:desc="" edc:mask="0x1" edc:name="PWM5PRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRH6" edc:desc="" edc:mask="0x1" edc:name="PWM5PRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5PRH7" edc:desc="" edc:mask="0x1" edc:name="PWM5PRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5PRH" edc:desc="" edc:mask="0xff" edc:name="PWM5PRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM5OF" edc:desc="" edc:name="PWM5OF" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD97">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5OFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM5OFL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD97">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5OFL0" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL1" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL2" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL3" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL4" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL5" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL6" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL7" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5OFL" edc:desc="" edc:mask="0xff" edc:name="PWM5OFL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5OFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM5OFH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD98">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5OFH0" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH1" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH2" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH3" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH4" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH5" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH6" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH7" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5OFH" edc:desc="" edc:mask="0xff" edc:name="PWM5OFH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
